{
  "backend/main.mo": "Main backend actor implementing video streaming platform with video metadata management, user profiles, favorites, watchlists, blob storage mixin, and access control authorization; includes public query endpoints for browsing and authenticated endpoints for user-specific features.",
  "feature_evidence.json": "Feature evidence report documenting PWA implementation including manifest.json creation, service worker setup, offline support, and theme configuration with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, pages, hooks, and configuration files describing the video streaming UI, authentication, routing, and styling architecture.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH-based dark theme color variables for both light and dark modes, defining background, foreground, card, accent, and sidebar colors.",
  "frontend/index.html": "Main HTML entry point with PWA manifest link, theme-color meta tag set to #1a1a1a, apple-touch-icon, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining Saanufox app metadata with standalone display mode, dark theme colors (#1a1a1a), and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/offline.html": "Standalone offline fallback page with dark cinematic styling matching app theme, displaying 'No Internet Connection' message and retry button.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets (images, CSS, JS, fonts), network-first for API calls, offline fallback to offline.html, and automatic cache versioning with cleanup.",
  "frontend/src/App.tsx": "Main application entry point that sets up TanStack Router with routes for browsing, watching, searching, categories, favorites, watchlist, and admin upload. Wraps the app in ThemeProvider with dark theme and includes ProfileSetupModal and Toaster components.",
  "frontend/src/components/CategoryFilter.tsx": "Renders a horizontal list of category filter buttons (Movies, Series, Documentaries, Animation, Comedy, Sci-Fi) with active state styling. Links to category pages using TanStack Router.",
  "frontend/src/components/FavoriteButton.tsx": "Heart-shaped button component that toggles video favorite status using mark/unmark mutations. Shows filled heart for favorited videos and fetches user favorites to determine state.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing logo, navigation links (Browse, Search, Favorites, Watchlist, Upload), LoginButton, and footer. Conditionally shows authenticated-only navigation items.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Appears automatically after login if user profile is null and saves profile using mutation.",
  "frontend/src/components/SearchBar.tsx": "Search input component with debounced query callback (300ms delay). Displays search icon and accepts initial value prop for controlled state.",
  "frontend/src/components/VideoCard.tsx": "Video thumbnail card with hover effects, play button overlay, and favorite/watchlist buttons for authenticated users. Supports YouTube thumbnails via externalThumbnail or falls back to static thumbnails mapped by video ID.",
  "frontend/src/components/VideoGrid.tsx": "Responsive grid layout component that renders VideoCard components for an array of videos. Shows 'No videos found' message when empty.",
  "frontend/src/components/VideoPlayer.tsx": "Video player component that renders either a YouTube iframe embed (for YouTube source videos) or an HTML5 video element (for blob source videos). Extracts YouTube video IDs and generates embed URLs.",
  "frontend/src/components/WatchlistButton.tsx": "Bookmark-shaped button component that toggles video watchlist status using add/remove mutations. Shows filled bookmark for watchlisted videos and fetches user watchlist to determine state.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Returns anonymous actor when unauthenticated, authenticated actor with admin token initialization when logged in, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API calls including user profiles, admin checks, video CRUD operations, search, categories, and favorites management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminUpload.tsx": "Admin page for uploading videos with YouTube URL support, form validation, thumbnail extraction, and authentication checks.",
  "frontend/src/pages/Browse.tsx": "Main browsing page displaying hero banner, category filters, all videos grid, and conditional admin upload link for authenticated users.",
  "frontend/src/pages/Category.tsx": "Category-specific video browsing page that filters and displays videos by category name from URL params.",
  "frontend/src/pages/Favorites.tsx": "User favorites page showing saved videos with authentication check and empty state handling.",
  "frontend/src/pages/Search.tsx": "Search page with search bar input and dynamic video results display based on user query.",
  "frontend/src/pages/Watch.tsx": "Video watch page component that displays a video player with metadata (title, genre, category, keywords) and authenticated user actions (favorite/watchlist buttons), with loading and error states.",
  "frontend/src/pages/Watchlist.tsx": "Watchlist page component that displays a grid of saved videos for authenticated users, with empty state and login prompt for unauthenticated users.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/youtubeHelpers.ts": "Helper functions for extracting YouTube video IDs from various URL formats, validating YouTube URLs, and generating thumbnail and embed URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, border radius variables, glow shadows, and accordion animations using typography, container queries, and animate plugins.",
  "project_state.json": "Project state document describing Saanufox as a PWA video streaming platform with YouTube integration, offline support, user authentication, and known issues with YouTube video display and upload functionality."
}