{
  "backend/main.mo": "Main actor implementing video streaming platform backend with user profiles, video CRUD operations, favorites, watchlists, search/filter functionality, and role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting a complete rebuild to resolve canister ID resolution errors, listing affected files, components, and test requirements.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, pages, hooks, utilities, and configuration files describing their functionality and implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with design tokens for light and dark themes using OKLCH color space, defining CSS custom properties for background, foreground, borders, and component colors.",
  "frontend/index.html": "Main HTML entry point for the Saanufox application with PWA manifest, meta tags, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, display mode, theme colors, and icon assets for progressive web app installation.",
  "frontend/public/offline.html": "Standalone offline fallback page with styled no-connection message and retry button for when the service worker detects network unavailability.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, offline fallback, and cache versioning with cleanup on activation.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (browse, watch, search, category, favorites, watchlist, profile, settings, admin, analytics) wrapped in ThemeProvider, Layout, ProfileSetupModal, and Toaster.",
  "frontend/src/components/CategoryFilter.tsx": "Category navigation component rendering buttons for predefined categories (Movies, Series, Documentaries, Animation, Comedy, Sci-Fi) with active state highlighting.",
  "frontend/src/components/DownloadButton.tsx": "A button component that allows authenticated users to download videos, handling both blob videos (direct download) and YouTube videos (opens in new tab with toast notification).",
  "frontend/src/components/FavoriteButton.tsx": "A heart-shaped toggle button that allows users to mark/unmark videos as favorites, with visual feedback showing filled heart for favorited videos.",
  "frontend/src/components/HeroBanner.tsx": "A Netflix-style hero banner displaying the first video from the catalog with title, genre, category, keywords, and action buttons (Play and More Info).",
  "frontend/src/components/Layout.tsx": "Main layout component with fixed header navigation, logo, menu links (Home, Search, My List, Watchlist, Analytics), and authentication-dependent UI elements including mobile navigation.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and error handling, clearing query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts authenticated users without a profile to enter their name, preventing dismissal until profile is created.",
  "frontend/src/components/SearchBar.tsx": "A debounced search input component with a 300ms delay that triggers search callbacks as the user types.",
  "frontend/src/components/VideoCard.tsx": "A Netflix-style video card with hover effects showing thumbnail, title, genre, category, and action buttons (play, watchlist, favorite, download) for authenticated users.",
  "frontend/src/components/VideoGrid.tsx": "A responsive grid layout component that displays video cards in 1-4 columns depending on screen size, with empty state handling.",
  "frontend/src/components/VideoPlayer.tsx": "Video player component that handles both YouTube embeds (via iframe) and blob videos (via HTML5 video element), with loading and error states.",
  "frontend/src/components/VideoRow.tsx": "A horizontal scrollable row component that displays a list of video cards with left/right navigation arrows that appear on hover. Includes scroll position tracking to show/hide arrows appropriately.",
  "frontend/src/components/WatchlistButton.tsx": "A bookmark button component that toggles videos in/out of the user's watchlist, showing filled state when video is bookmarked. Uses React Query mutations for add/remove operations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient. Manages authentication state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, admin checks, video CRUD operations, watchlist management, and search functionality. Each hook uses the actor from useActor and manages query/mutation state.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space. Includes Netflix-specific styling utilities for shadows, hover effects, and scrollbar hiding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrappers around the main App component.",
  "frontend/src/pages/AdminUpload.tsx": "Admin page for uploading videos with two modes: YouTube URL or file upload. Handles form validation, file processing, thumbnail generation, and video metadata submission with progress tracking.",
  "frontend/src/pages/Analytics.tsx": "Displays platform analytics including total registered user count, requiring authentication via Internet Identity. Shows loading states, error alerts, and placeholder cards for future analytics features.",
  "frontend/src/pages/Browse.tsx": "Main browsing page that displays a hero banner, category filter, and video rows grouped by category and genre. Shows loading spinner while fetching all videos and handles empty states.",
  "frontend/src/pages/Category.tsx": "Displays videos filtered by a specific category from URL params. Includes a category filter component and shows loading/empty states.",
  "frontend/src/pages/Favorites.tsx": "Shows user's favorited videos in a grid layout, requiring authentication. Displays prompts to log in or browse videos when empty.",
  "frontend/src/pages/Profile.tsx": "Displays authenticated user's profile information including name and Internet Identity principal. Shows loading states and provides link to settings page for editing.",
  "frontend/src/pages/Search.tsx": "Search page with a search bar that queries videos and displays results in a grid. Shows loading states and prompts user to enter search terms when empty.",
  "frontend/src/pages/Settings.tsx": "Settings page allowing authenticated users to update their profile name. Includes form validation, loading states, and toast notifications for success/error feedback.",
  "frontend/src/pages/Watch.tsx": "Video player page that displays a single video with metadata, action buttons (favorite, watchlist, download), and related videos. Handles loading and error states with appropriate UI feedback.",
  "frontend/src/pages/Watchlist.tsx": "Displays user's watchlist videos in a grid layout, requiring authentication. Shows prompts to log in or browse videos when empty or unauthenticated.",
  "frontend/src/utils/fileHelpers.ts": "Provides functions to sanitize video titles into filesystem-safe filenames and generate download filenames for videos, removing invalid characters and limiting length.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/src/utils/youtubeHelpers.ts": "Extracts YouTube video IDs from various URL formats, validates YouTube URLs, and generates thumbnail and embed URLs from video IDs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom Netflix-themed colors using OKLCH color space, animations, shadows, and extended spacing utilities.",
  "project_state.json": "Project state tracking for Saanufox Netflix-style video streaming platform on Internet Computer, documenting architecture, known canister ID resolution issues, and pending rebuild requirements."
}