{
  "backend/main.mo": "Main backend actor implementing video streaming platform with blob storage, access control, user profiles, video CRUD operations, favorites, watchlist, and admin-only video creation with guest browsing allowed.",
  "feature_evidence.json": "Empty feature evidence report JSON structure with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components, pages, hooks, and configuration files describing the Netflix-style video streaming UI with authentication, admin features, and dark theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with PWA manifest, meta tags, and root div for React application mounting.",
  "frontend/public/manifest.json": "PWA manifest defining Saanufox app metadata, display mode, theme colors, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/offline.html": "Standalone offline fallback page with Saanufox branding, gradient styling, and retry button for when network is unavailable.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, offline fallback, and cache versioning with cleanup of old caches.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for browse, watch, search, category, favorites, watchlist, profile, settings, and admin upload, wrapped with ThemeProvider, Layout, ProfileSetupModal, and Toaster.",
  "frontend/src/components/CategoryFilter.tsx": "Category navigation component rendering buttons for Movies, Series, Documentaries, Animation, Comedy, and Sci-Fi with active state highlighting using TanStack Router links.",
  "frontend/src/components/DownloadButton.tsx": "A button component that allows authenticated users to download videos, handling both blob videos (direct download) and YouTube videos (opens in new tab with toast notification).",
  "frontend/src/components/FavoriteButton.tsx": "A heart-shaped toggle button that allows users to mark/unmark videos as favorites, with visual feedback showing filled heart for favorited videos.",
  "frontend/src/components/HeroBanner.tsx": "A Netflix-style hero banner displaying the first video from the catalog with title, genre, category, keywords, and action buttons (Play and More Info).",
  "frontend/src/components/Layout.tsx": "Main layout component with fixed header navigation, logo, menu links (Home, Search, My List, Watchlist, Upload for admins), login button, and mobile bottom navigation.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and error handling for already-authenticated users.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter their name for profile setup, blocking interaction until completed.",
  "frontend/src/components/SearchBar.tsx": "A search input component with debounced query handling (300ms delay) and search icon, triggering callback on value changes.",
  "frontend/src/components/VideoCard.tsx": "A Netflix-style video card with thumbnail, hover effects showing title/genre/category, and action buttons (Play, Watchlist, Favorite, Download) for authenticated users.",
  "frontend/src/components/VideoGrid.tsx": "A responsive grid layout component that displays video cards in 1-4 columns depending on screen size, with empty state message.",
  "frontend/src/components/VideoPlayer.tsx": "Video player component that handles both YouTube embeds (via iframe) and blob videos (via HTML5 video element), with loading and error states.",
  "frontend/src/components/VideoRow.tsx": "A horizontal scrollable row component that displays a list of video cards with left/right navigation arrows that appear on hover. Manages scroll state and visibility of navigation arrows based on scroll position.",
  "frontend/src/components/WatchlistButton.tsx": "A bookmark button component that toggles a video's presence in the user's watchlist. Uses React Query hooks to fetch watchlist state and mutate add/remove operations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient. Manages authentication state, identity persistence, and delegation validation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, admin checks, video CRUD operations, watchlist management, and search functionality. Each hook uses the actor from useActor and manages query/mutation state with proper cache invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space. Defines Netflix-style design tokens, utility classes for scrollbar hiding, shadows, and hover scale animations.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication. Renders the main App component with necessary context providers.",
  "frontend/src/pages/AdminUpload.tsx": "Admin-only page for uploading videos either via YouTube URL or file upload. Handles form validation, file processing, progress tracking, and video metadata submission with authentication and admin permission checks.",
  "frontend/src/pages/Analytics.tsx": "Admin-only analytics dashboard page that displays total registered user count with authentication and authorization checks. Shows appropriate error states for unauthenticated users, non-admin users, and loading/error conditions.",
  "frontend/src/pages/Browse.tsx": "Main browsing page that displays a hero banner, category filter, and organizes videos into rows grouped by category and genre. Shows loading state and handles empty video lists.",
  "frontend/src/pages/Category.tsx": "Category-specific page that displays videos filtered by category name from URL params. Includes category filter component and shows loading/empty states.",
  "frontend/src/pages/Favorites.tsx": "Displays user's favorited videos in a grid layout with authentication check. Shows appropriate messages for unauthenticated users and empty favorites list.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying user's name and Internet Identity principal with authentication check. Includes link to settings page for profile editing.",
  "frontend/src/pages/Search.tsx": "Search page with search bar and video grid displaying results based on user query. Shows loading state and prompts for search input when empty.",
  "frontend/src/pages/Settings.tsx": "Settings page allowing authenticated users to update their profile name with form validation and toast notifications. Includes loading states and authentication checks.",
  "frontend/src/pages/Watch.tsx": "Video watch page displaying video player, metadata, action buttons (favorite/watchlist/download), and related videos. Handles loading and error states with navigation back to browse.",
  "frontend/src/pages/Watchlist.tsx": "Displays user's watchlist videos in a grid layout with authentication check. Shows appropriate messages for unauthenticated users and empty watchlist.",
  "frontend/src/utils/fileHelpers.ts": "Provides functions to sanitize video titles for filesystem-safe filenames and generate download filenames for videos, removing invalid characters and limiting length.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and parameter cleanup capabilities.",
  "frontend/src/utils/youtubeHelpers.ts": "Extracts YouTube video IDs from various URL formats, validates YouTube URLs, and generates thumbnail and embed URLs from video IDs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, Netflix-themed shadows, accordion/fade animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata indicating a pending deployment request (AR-1) to deploy Version 17 of the Saanufox application to Internet Computer mainnet production."
}