{
  "backend/main.mo": "Main backend actor implementing video streaming platform with authorization (admin/user roles), user profiles, video CRUD operations, favorites/watchlist management, and blob storage integration using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting four PWA enhancement features: manifest updates, service worker offline-first strategy, install prompt component, and comprehensive PWA meta tags with associated test IDs and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components (Layout, VideoCard, VideoPlayer, etc.), pages (Browse, Watch, Search), hooks (useQueries), and configuration files with Netflix-style design implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space, including Netflix-inspired design tokens for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "Main HTML entry point with comprehensive PWA meta tags including theme-color, apple-mobile-web-app settings, manifest link, and apple-touch-icon for enhanced mobile and installability support.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata (name, description, colors), standalone display mode, any orientation, and comprehensive icon set with 192x192 and 512x512 sizes for both 'any' and 'maskable' purposes.",
  "frontend/public/offline.html": "Styled offline fallback page with Saanufox branding, animated icon, informational content about offline functionality, and retry button for reconnection attempts when network is unavailable.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategies for static assets and images, with network-first for navigation and explicit bypass for Internet Identity and IC canister URLs.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with routes for browse, watch, search, category, favorites, watchlist, profile, settings, and admin upload pages, wrapped in ThemeProvider.",
  "frontend/src/components/CategoryFilter.tsx": "Renders a horizontal list of category filter buttons (Movies, Series, Documentaries, etc.) with active state highlighting.",
  "frontend/src/components/DownloadButton.tsx": "Authenticated-only button that downloads blob videos directly or opens YouTube videos in a new tab, with loading states and toast notifications.",
  "frontend/src/components/FavoriteButton.tsx": "Heart-shaped toggle button that marks/unmarks videos as favorites, with filled state when active.",
  "frontend/src/components/HeroBanner.tsx": "Full-height hero banner displaying the first video with background image, gradient overlays, title, genre, and Play/More Info action buttons.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt component that captures beforeinstallprompt event and displays a dismissible banner encouraging users to install the app.",
  "frontend/src/components/Layout.tsx": "Main layout component with fixed header navigation, logo, authenticated/admin-conditional menu items, and login button.",
  "frontend/src/components/LoginButton.tsx": "Button component handling Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, blocking interaction until submitted.",
  "frontend/src/components/SearchBar.tsx": "Search input component with debounced query handling (300ms delay) and a search icon, used for filtering videos.",
  "frontend/src/components/VideoCard.tsx": "Netflix-style video card with hover effects showing title, genre, category, and action buttons (play, watchlist, favorite, download) for authenticated users.",
  "frontend/src/components/VideoGrid.tsx": "Responsive grid layout component that displays an array of VideoCard components or a 'no videos found' message.",
  "frontend/src/components/VideoPlayer.tsx": "Video player component that handles both YouTube embeds and blob video sources with loading states and error handling.",
  "frontend/src/components/VideoRow.tsx": "Horizontal scrollable row of video cards with left/right navigation arrows that appear on hover, used for categorized video collections.",
  "frontend/src/components/WatchlistButton.tsx": "Toggle button with bookmark icon that adds or removes videos from the user's watchlist with visual feedback for active state.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, user counts, and video operations (get all, search, by category, add, update, delete, favorites). Uses the actor from useActor hook to call backend methods and manages query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, Netflix-style color palette, and utility classes for scrollbar hiding, shadows, and hover scale effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the DOM root.",
  "frontend/src/pages/AdminUpload.tsx": "Admin-only page for uploading videos via YouTube URL or file upload, with form validation, progress tracking, and metadata input (title, category, genre, keywords). Checks admin status and authentication before allowing access.",
  "frontend/src/pages/Analytics.tsx": "Admin-only analytics dashboard displaying total registered user count. Includes authentication and admin permission checks with appropriate error states.",
  "frontend/src/pages/Browse.tsx": "Main browsing page with hero banner, category filter, and video rows grouped by category and genre. Shows loading states and handles unauthenticated users.",
  "frontend/src/pages/Category.tsx": "Category-specific page that displays videos filtered by category name from URL params, with category filter navigation and loading states.",
  "frontend/src/pages/Favorites.tsx": "Displays user's favorited videos in a grid layout. Requires authentication and shows appropriate empty states with navigation back to browse.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying name and Internet Identity principal, with authentication check and link to settings page for editing.",
  "frontend/src/pages/Search.tsx": "Search page component that displays a search bar and shows video results in a grid layout, with loading states and empty state messaging.",
  "frontend/src/pages/Settings.tsx": "Settings page for authenticated users to update their profile name, with authentication checks, loading states, and form validation using toast notifications.",
  "frontend/src/pages/Watch.tsx": "Video watch page that displays a video player, metadata, action buttons (favorite/watchlist/download), and related videos, with error handling and authentication-aware features.",
  "frontend/src/pages/Watchlist.tsx": "Watchlist page that displays a grid of videos saved by the authenticated user, with authentication checks and empty state handling.",
  "frontend/src/utils/fileHelpers.ts": "Utility functions for sanitizing video titles into filesystem-safe filenames and generating download filenames with proper character handling and length limits.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting, storing, and managing query parameters from both regular URLs and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/youtubeHelpers.ts": "YouTube URL parsing utilities that extract video IDs from various URL formats, validate URLs, and generate thumbnail and embed URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom Netflix-themed colors using OKLCH color space, extended animations, spacing, and shadows for the application design system.",
  "project_state.json": "Project state file for Saanufox web application tracking PWA implementation features including manifest configuration, service worker enhancements, install prompts, meta tags, and offline fallback page improvements. Contains 5 completed features and 1 pending feature request for PWA support, with image requirements for app icons in various sizes and formats."
}